BitNibble/Source_Library/stm32f446lib/Library/Inc/stm32446tim2to5.h
/******************************************************************************
	STM32 446 TIM 2 to 5
Author: Sergio Santos 
	<sergio.salazar.santos@gmail.com>
License: GNU General Public License
Hardware: STM32-446
Date: 22062023
Comment:
	
*******************************************************************************/
#ifndef _STM32446TIM2TO5_H_
	#define _STM32446TIM2TO5_H_
/*** Library ***/
#include "stm32query.h"
/*** TIMER 2 to 5 Bit Mapping TypeDef ***/
// CR1
typedef struct{
	void (*ckd)(uint8_t value);
	uint8_t (*get_ckd)(void);
	void (*apre)(uint8_t bool);
	void (*cms)(uint8_t value);
	void (*dir)(uint8_t bool);
	void (*opm)(uint8_t bool);
	void (*urs)(uint8_t bool);
	void (*udis)(uint8_t bool);
	void (*cen)(uint8_t bool);
}STM32446TIM2_CR1, STM32446TIM3_CR1, STM32446TIM4_CR1, STM32446TIM5_CR1;
// CR2
typedef struct{
	void (*ois4)(uint8_t bool);
	void (*ois3n)(uint8_t bool);
	void (*ois3)(uint8_t bool);
	void (*ois2n)(uint8_t bool);
	void (*ois2)(uint8_t bool);
	void (*ois1n)(uint8_t bool);
	void (*ois1)(uint8_t bool);
	void (*ti1s)(uint8_t bool);
	void (*mms)(uint8_t value);
	void (*ccds)(uint8_t bool);
	void (*ccus)(uint8_t bool);
	void (*ccpc)(uint8_t bool);
}STM32446TIM2_CR2, STM32446TIM3_CR2, STM32446TIM4_CR2, STM32446TIM5_CR2;
// SMCR
typedef struct{
	void (*etp)(uint8_t bool);
	void (*ece)(uint8_t bool);
	void (*etps)(uint8_t value);
	void (*etf)(uint8_t value);
	void (*msm)(uint8_t bool);
	void (*ts)(uint8_t value);
	void (*sms)(uint8_t value);
}STM32446TIM2_SMCR, STM32446TIM3_SMCR, STM32446TIM4_SMCR, STM32446TIM5_SMCR;
// DIER
typedef struct{
	void (*tde)(uint8_t bool);
	void (*comde)(uint8_t bool);
	void (*cc4de)(uint8_t bool);
	void (*cc3de)(uint8_t bool);
	void (*cc2de)(uint8_t bool);
	void (*cc1de)(uint8_t bool);
	void (*ude)(uint8_t bool);
	void (*bie)(uint8_t bool);
	void (*tie)(uint8_t bool);
	void (*comie)(uint8_t bool);
	void (*cc4ie)(uint8_t bool);
	void (*cc3ie)(uint8_t bool);
	void (*cc2ie)(uint8_t bool);
	void (*cc1ie)(uint8_t bool);
	void (*uie)(uint8_t bool);
}STM32446TIM2_DIER, STM32446TIM3_DIER, STM32446TIM4_DIER, STM32446TIM5_DIER;
// SR
typedef struct{
	uint8_t (*cc4of)(void);
	void (*clear_cc4of)(void);
	uint8_t (*cc3of)(void);
	void (*clear_cc3of)(void);
	uint8_t (*cc2of)(void);
	void (*clear_cc2of)(void);
	uint8_t (*cc1of)(void);
	void (*clear_cc1of)(void);
	uint8_t (*bif)(void);
	void (*clear_bif)(void);
	uint8_t (*tif)(void);
	void (*clear_tif)(void);
	uint8_t (*comif)(void);
	void (*clear_comif)(void);
	uint8_t (*cc4if)(void);
	void (*clear_cc4if)(void);
	uint8_t (*cc3if)(void);
	void (*clear_cc3if)(void);
	uint8_t (*cc2if)(void);
	void (*clear_cc2if)(void);
	uint8_t (*cc1if)(void);
	void (*clear_cc1if)(void);
	uint8_t (*uif)(void);
	void (*clear_uif)(void);
}STM32446TIM2_SR, STM32446TIM3_SR, STM32446TIM4_SR, STM32446TIM5_SR;
// EGR
typedef struct{
	void (*bg)(void);
	void (*tg)(void);
	void (*comg)(void);
	void (*cc4g)(void);
	void (*cc3g)(void);
	void (*cc2g)(void);
	void (*cc1g)(void);
	void (*ug)(void);
}STM32446TIM2_EGR, STM32446TIM3_EGR, STM32446TIM4_EGR, STM32446TIM5_EGR;
// CCMR1
typedef struct{
	void (*oc2ce)(uint8_t bool);
	void (*oc2m)(uint8_t value);
	void (*ic2f)(uint8_t value);
	void (*oc2pe)(uint8_t bool);
	void (*oc2fe)(uint8_t bool);
	void (*ic2psc)(uint8_t value);
	void (*cc2s)(uint8_t value);
	void (*oc1ce)(uint8_t bool);
	void (*oc1m)(uint8_t value);
	void (*ic1f)(uint8_t value);
	void (*oc1pe)(uint8_t bool);
	void (*oc1fe)(uint8_t bool);
	void (*ic1psc)(uint8_t value);
	void (*cc1s)(uint8_t value);
}STM32446TIM2_CCMR1, STM32446TIM3_CCMR1, STM32446TIM4_CCMR1, STM32446TIM5_CCMR1;
// CCMR2
typedef struct{
	void (*oc4ce)(uint8_t bool);
	void (*oc4m)(uint8_t value);
	void (*ic4f)(uint8_t value);
	void (*oc4pe)(uint8_t bool);
	void (*oc4fe)(uint8_t bool);
	void (*ic4psc)(uint8_t value);
	void (*cc4s)(uint8_t value);
	void (*oc3ce)(uint8_t bool);
	void (*oc3m)(uint8_t value);
	void (*ic3f)(uint8_t value);
	void (*oc3pe)(uint8_t bool);
	void (*oc3fe)(uint8_t bool);
	void (*ic3psc)(uint8_t value);
	void (*cc3s)(uint8_t value);
}STM32446TIM2_CCMR2, STM32446TIM3_CCMR2, STM32446TIM4_CCMR2, STM32446TIM5_CCMR2;
// CCER
typedef struct{
	void (*cc4np)(uint8_t bool);
	void (*cc4p)(uint8_t bool);
	void (*cc4e)(uint8_t bool);
	void (*cc3np)(uint8_t bool);
	void (*cc3ne)(uint8_t bool);
	void (*cc3p)(uint8_t bool);
	void (*cc3e)(uint8_t bool);
	void (*cc2np)(uint8_t bool);
	void (*cc2ne)(uint8_t bool);
	void (*cc2p)(uint8_t bool);
	void (*cc2e)(uint8_t bool);
	void (*cc1np)(uint8_t bool);
	void (*cc1ne)(uint8_t bool);
	void (*cc1p)(uint8_t bool);
	void (*cc1e)(uint8_t bool);
}STM32446TIM2_CCER, STM32446TIM3_CCER, STM32446TIM4_CCER, STM32446TIM5_CCER;
// BDTR
typedef struct{
	void (*moe)(uint8_t bool);
	void (*aoe)(uint8_t bool);
	void (*bkp)(uint8_t bool);
	void (*bke)(uint8_t bool);
	void (*ossr)(uint8_t bool);
	void (*ossi)(uint8_t bool);
	void (*lock)(uint8_t value);
	void (*dtg)(uint8_t value);
}STM32446TIM2_BDTR, STM32446TIM3_BDTR, STM32446TIM4_BDTR, STM32446TIM5_BDTR;
// DCR
typedef struct{
	void (*dbl)(uint8_t value);
	void (*dba)(uint8_t value);
}STM32446TIM2_DCR, STM32446TIM3_DCR, STM32446TIM4_DCR, STM32446TIM5_DCR;
/*** TIMER 2 to 5 TypeDef ***/
// ( 2 and 5 ) TIM
typedef struct
{
	TIM_TypeDef* reg;
	/*** Bit Mapping ***/
	STM32446TIM2_CR1* cr1;
	STM32446TIM2_CR2* cr2;
	STM32446TIM2_SMCR* smcr;
	STM32446TIM2_DIER* dier;
	STM32446TIM2_SR* sr;
	STM32446TIM2_EGR* egr;
	STM32446TIM2_CCMR1* ccmr1;
	STM32446TIM2_CCMR2* ccmr2;
	STM32446TIM2_CCER* ccer;
	STM32446TIM2_DCR* dcr;
	void (*cnt)(uint32_t value);
	uint32_t (*get_cnt)(void);
	void (*psc)(uint16_t value);
	void (*arr)(uint32_t value);
	void (*ccr1)(uint32_t value);
	void (*ccr2)(uint32_t value);
	void (*ccr3)(uint32_t value);
	void (*ccr4)(uint32_t value);
	void (*dmar)(uint16_t value);
	void (*or)(uint8_t value);
	/*** Other ***/
	void (*clock)(uint8_t bool);
	void (*nvic)(uint8_t bool);
}STM32446TIM2obj, STM32446TIM5obj;
// ( 3 and 4 ) TIM
typedef struct
{
	TIM_TypeDef* reg;
	/*** Bit Mapping ***/
	STM32446TIM3_CR1* cr1;
	STM32446TIM3_CR2* cr2;
	STM32446TIM3_SMCR* smcr;
	STM32446TIM3_DIER* dier;
	STM32446TIM3_SR* sr;
	STM32446TIM3_EGR* egr;
	STM32446TIM3_CCMR1* ccmr1;
	STM32446TIM3_CCMR2* ccmr2;
	STM32446TIM3_CCER* ccer;
	STM32446TIM3_DCR* dcr;
	void (*cnt)(uint16_t value);
	uint16_t (*get_cnt)(void);
	void (*psc)(uint16_t value);
	void (*arr)(uint16_t value);
	void (*ccr1)(uint16_t value);
	void (*ccr2)(uint16_t value);
	void (*ccr3)(uint16_t value);
	void (*ccr4)(uint16_t value);
	void (*dmar)(uint16_t value);
	/*** Other ***/
	void (*clock)(uint8_t bool);
	void (*nvic)(uint8_t bool);
}STM32446TIM3obj, STM32446TIM4obj;
