BitNibble/Source_Library/stm32f446lib/Library/Inc/stm32446tim2to5.h
/***********************/
/*** INIC TIM 2 to 5 ***/
/***********************/
STM32446TIM2obj tim2_inic(void);
STM32446TIM2obj* tim2(void);
STM32446TIM3obj tim3_inic(void);
STM32446TIM3obj* tim3(void);
STM32446TIM4obj tim4_inic(void);
STM32446TIM4obj* tim4(void);
STM32446TIM5obj tim5_inic(void);
STM32446TIM5obj* tim5(void);
/****************************************/
/*** TIM2 Procedure & Function Header ***/
/****************************************/
void STM32446Tim2Clock(uint8_t bool);
void STM32446Tim2Nvic(uint8_t bool);
/*** TIM2 Bit Mapping Header ***/
// CR1
void STM32446Tim2_ckd(uint8_t value);
uint8_t STM32446Tim2_get_ckd(void);
void STM32446Tim2_set_apre(uint8_t bool);
void STM32446Tim2_set_cms(uint8_t value);
void STM32446Tim2_set_dir(uint8_t bool);
void STM32446Tim2_set_opm(uint8_t bool);
void STM32446Tim2_set_urs(uint8_t bool);
void STM32446Tim2_set_udis(uint8_t bool);
void STM32446Tim2_cen(uint8_t bool);
// CR2
void STM32446Tim2_ti1s(uint8_t bool);
void STM32446Tim2_mms(uint8_t value);
void STM32446Tim2_ccds(uint8_t bool);
// SMCR
void STM32446Tim2_etp(uint8_t bool);
void STM32446Tim2_ece(uint8_t bool);
void STM32446Tim2_etps(uint8_t value);
void STM32446Tim2_etf(uint8_t value);
void STM32446Tim2_msm(uint8_t bool);
void STM32446Tim2_ts(uint8_t value);
void STM32446Tim2_sms(uint8_t value);
// DIER
void STM32446Tim2_tde(uint8_t bool);
void STM32446Tim2_cc4de(uint8_t bool);
void STM32446Tim2_cc3de(uint8_t bool);
void STM32446Tim2_cc2de(uint8_t bool);
void STM32446Tim2_cc1de(uint8_t bool);
void STM32446Tim2_ude(uint8_t bool);
void STM32446Tim2_tie(uint8_t bool);
void STM32446Tim2_cc4ie(uint8_t bool);
void STM32446Tim2_cc3ie(uint8_t bool);
void STM32446Tim2_cc2ie(uint8_t bool);
void STM32446Tim2_cc1ie(uint8_t bool);
void STM32446Tim2_uie(uint8_t bool);
// SR
uint8_t STM32446Tim2_cc4of(void);
void STM32446Tim2_clear_cc4of(void);
uint8_t STM32446Tim2_cc3of(void);
void STM32446Tim2_clear_cc3of(void);
uint8_t STM32446Tim2_cc2of(void);
void STM32446Tim2_clear_cc2of(void);
uint8_t STM32446Tim2_cc1of(void);
void STM32446Tim2_clear_cc1of(void);
uint8_t STM32446Tim2_tif(void);
void STM32446Tim2_clear_tif(void);
uint8_t STM32446Tim2_cc4if(void);
void STM32446Tim2_clear_cc4if(void);
uint8_t STM32446Tim2_cc3if(void);
void STM32446Tim2_clear_cc3if(void);
uint8_t STM32446Tim2_cc2if(void);
void STM32446Tim2_clear_cc2if(void);
uint8_t STM32446Tim2_cc1if(void);
void STM32446Tim2_clear_cc1if(void);
uint8_t STM32446Tim2_uif(void);
void STM32446Tim2_clear_uif(void);
// EGR
void STM32446Tim2_tg(void);
void STM32446Tim2_cc4g(void);
void STM32446Tim2_cc3g(void);
void STM32446Tim2_cc2g(void);
void STM32446Tim2_cc1g(void);
void STM32446Tim2_ug(void);
// CCMR1
void STM32446Tim2_oc2ce(uint8_t value);
void STM32446Tim2_oc2m(uint8_t value);
void STM32446Tim2_ic2f(uint8_t value);
void STM32446Tim2_oc2pe(uint8_t bool);
void STM32446Tim2_oc2fe(uint8_t bool);
void STM32446Tim2_ic2psc(uint8_t value);
void STM32446Tim2_cc2s(uint8_t value);
void STM32446Tim2_oc1ce(uint8_t value);
void STM32446Tim2_oc1m(uint8_t value);
void STM32446Tim2_ic1f(uint8_t value);
void STM32446Tim2_oc1pe(uint8_t bool);
void STM32446Tim2_oc1fe(uint8_t bool);
void STM32446Tim2_ic1psc(uint8_t value);
void STM32446Tim2_cc1s(uint8_t value);
// CCMR2
void STM32446Tim2_oc4ce(uint8_t value);
void STM32446Tim2_oc4m(uint8_t value);
void STM32446Tim2_ic4f(uint8_t value);
void STM32446Tim2_oc4pe(uint8_t bool);
void STM32446Tim2_oc4fe(uint8_t bool);
void STM32446Tim2_ic4psc(uint8_t value);
void STM32446Tim2_cc4s(uint8_t value);
void STM32446Tim2_oc3ce(uint8_t value);
void STM32446Tim2_oc3m(uint8_t value);
void STM32446Tim2_ic3f(uint8_t value);
void STM32446Tim2_oc3pe(uint8_t bool);
void STM32446Tim2_oc3fe(uint8_t bool);
void STM32446Tim2_ic3psc(uint8_t value);
void STM32446Tim2_cc3s(uint8_t value);
// CCER
void STM32446Tim2_cc4np(uint8_t bool);
void STM32446Tim2_cc4p(uint8_t bool);
void STM32446Tim2_cc4e(uint8_t bool);
void STM32446Tim2_cc3np(uint8_t bool);
void STM32446Tim2_cc3p(uint8_t bool);
void STM32446Tim2_cc3e(uint8_t bool);
void STM32446Tim2_cc2np(uint8_t bool);
void STM32446Tim2_cc2p(uint8_t bool);
void STM32446Tim2_cc2e(uint8_t bool);
void STM32446Tim2_cc1np(uint8_t bool);
void STM32446Tim2_cc1p(uint8_t bool);
void STM32446Tim2_cc1e(uint8_t bool);
// CNT
void STM32446Tim2_cnt(uint32_t value);
uint32_t STM32446Tim2_get_cnt(void);
// PSC
void STM32446Tim2_psc(uint16_t value);
// ARR
void STM32446Tim2_arr(uint32_t value);
// CCR1
void STM32446Tim2_ccr1(uint32_t value);
// CCR2
void STM32446Tim2_ccr2(uint32_t value);
// CCR3
void STM32446Tim2_ccr3(uint32_t value);
// CCR4
void STM32446Tim2_ccr4(uint32_t value);
// DCR
void STM32446Tim2_dbl(uint8_t value);
void STM32446Tim2_dba(uint8_t value);
// DMAR
void STM32446Tim2_dmab(uint16_t value);
uint16_t STM32446Tim2_get_dmab(void);
// OR
void STM32446Tim2_itr1_rmp(uint8_t value);
/****************************************/
/*** TIM3 Procedure & Function Header ***/
/****************************************/
void STM32446Tim3Clock(uint8_t bool);
void STM32446Tim3Nvic(uint8_t bool);
/*** TIM3 Bit Mapping Header ***/
// CR1
void STM32446Tim3_ckd(uint8_t value);
uint8_t STM32446Tim3_get_ckd(void);
void STM32446Tim3_set_apre(uint8_t bool);
void STM32446Tim3_set_cms(uint8_t value);
void STM32446Tim3_set_dir(uint8_t bool);
void STM32446Tim3_set_opm(uint8_t bool);
void STM32446Tim3_set_urs(uint8_t bool);
void STM32446Tim3_set_udis(uint8_t bool);
void STM32446Tim3_cen(uint8_t bool);
// CR2
void STM32446Tim3_ti1s(uint8_t bool);
void STM32446Tim3_mms(uint8_t value);
void STM32446Tim3_ccds(uint8_t bool);
// SMCR
void STM32446Tim3_etp(uint8_t bool);
void STM32446Tim3_ece(uint8_t bool);
void STM32446Tim3_etps(uint8_t value);
void STM32446Tim5_etf(uint8_t value);
void STM32446Tim3_msm(uint8_t bool);
void STM32446Tim3_ts(uint8_t value);
void STM32446Tim3_sms(uint8_t value);
// DIER
void STM32446Tim3_tde(uint8_t bool);
void STM32446Tim3_cc4de(uint8_t bool);
void STM32446Tim3_cc3de(uint8_t bool);
void STM32446Tim3_cc2de(uint8_t bool);
void STM32446Tim3_cc1de(uint8_t bool);
void STM32446Tim3_ude(uint8_t bool);
void STM32446Tim3_tie(uint8_t bool);
void STM32446Tim3_cc4ie(uint8_t bool);
void STM32446Tim3_cc3ie(uint8_t bool);
void STM32446Tim3_cc2ie(uint8_t bool);
void STM32446Tim3_cc1ie(uint8_t bool);
void STM32446Tim3_uie(uint8_t bool);
// SR
uint8_t STM32446Tim3_cc4of(void);
void STM32446Tim3_clear_cc4of(void);
uint8_t STM32446Tim3_cc3of(void);
void STM32446Tim3_clear_cc3of(void);
uint8_t STM32446Tim3_cc2of(void);
void STM32446Tim3_clear_cc2of(void);
uint8_t STM32446Tim3_cc1of(void);
void STM32446Tim3_clear_cc1of(void);
uint8_t STM32446Tim3_tif(void);
void STM32446Tim3_clear_tif(void);
uint8_t STM32446Tim3_cc4if(void);
void STM32446Tim3_clear_cc4if(void);
uint8_t STM32446Tim3_cc3if(void);
void STM32446Tim3_clear_cc3if(void);
uint8_t STM32446Tim3_cc2if(void);
void STM32446Tim3_clear_cc2if(void);
uint8_t STM32446Tim3_cc1if(void);
void STM32446Tim3_clear_cc1if(void);
uint8_t STM32446Tim3_uif(void);
void STM32446Tim3_clear_uif(void);
// EGR
void STM32446Tim3_tg(void);
void STM32446Tim3_cc4g(void);
void STM32446Tim3_cc3g(void);
void STM32446Tim3_cc2g(void);
void STM32446Tim3_cc1g(void);
void STM32446Tim3_ug(void);
// CCMR1
void STM32446Tim3_oc2ce(uint8_t value);
void STM32446Tim3_oc2m(uint8_t value);
void STM32446Tim3_ic2f(uint8_t value);
void STM32446Tim3_oc2pe(uint8_t bool);
void STM32446Tim3_oc2fe(uint8_t bool);
void STM32446Tim3_ic2psc(uint8_t value);
void STM32446Tim3_cc2s(uint8_t value);
void STM32446Tim3_oc1ce(uint8_t value);
void STM32446Tim3_oc1m(uint8_t value);
void STM32446Tim3_ic1f(uint8_t value);
void STM32446Tim3_oc1pe(uint8_t bool);
void STM32446Tim3_oc1fe(uint8_t bool);
void STM32446Tim3_ic1psc(uint8_t value);
void STM32446Tim3_cc1s(uint8_t value);
// CCMR2
void STM32446Tim3_oc4ce(uint8_t value);
void STM32446Tim3_oc4m(uint8_t value);
void STM32446Tim3_ic4f(uint8_t value);
void STM32446Tim3_oc4pe(uint8_t bool);
void STM32446Tim3_oc4fe(uint8_t bool);
void STM32446Tim3_ic4psc(uint8_t value);
void STM32446Tim3_cc4s(uint8_t value);
void STM32446Tim3_oc3ce(uint8_t value);
void STM32446Tim3_oc3m(uint8_t value);
void STM32446Tim3_ic3f(uint8_t value);
void STM32446Tim3_oc3pe(uint8_t bool);
void STM32446Tim3_oc3fe(uint8_t bool);
void STM32446Tim3_ic3psc(uint8_t value);
void STM32446Tim3_cc3s(uint8_t value);
// CCER
void STM32446Tim3_cc4np(uint8_t bool);
void STM32446Tim3_cc4p(uint8_t bool);
void STM32446Tim3_cc4e(uint8_t bool);
void STM32446Tim3_cc3np(uint8_t bool);
void STM32446Tim3_cc3p(uint8_t bool);
void STM32446Tim3_cc3e(uint8_t bool);
void STM32446Tim3_cc2np(uint8_t bool);
void STM32446Tim3_cc2p(uint8_t bool);
void STM32446Tim3_cc2e(uint8_t bool);
void STM32446Tim3_cc1np(uint8_t bool);
void STM32446Tim3_cc1p(uint8_t bool);
void STM32446Tim3_cc1e(uint8_t bool);
// CNT
void STM32446Tim3_cnt(uint16_t value);
uint16_t STM32446Tim3_get_cnt(void);
// PSC
void STM32446Tim3_psc(uint16_t value);
// ARR
void STM32446Tim3_arr(uint16_t value);
// CCR1
void STM32446Tim3_ccr1(uint16_t value);
// CCR2
void STM32446Tim3_ccr2(uint16_t value);
// CCR3
void STM32446Tim3_ccr3(uint16_t value);
// CCR4
void STM32446Tim3_ccr4(uint16_t value);
// DCR
void STM32446Tim3_dbl(uint8_t value);
void STM32446Tim3_dba(uint8_t value);
// DMAR
void STM32446Tim3_dmab(uint16_t value);
uint16_t STM32446Tim3_get_dmab(void);
/****************************************/
/*** TIM4 Procedure & Function Header ***/
/****************************************/
void STM32446Tim4Clock(uint8_t bool);
void STM32446Tim4Nvic(uint8_t bool);
/*** TIM4 Bit Mapping Header ***/
// CR1
void STM32446Tim4_ckd(uint8_t value);
uint8_t STM32446Tim4_get_ckd(void);
void STM32446Tim4_set_apre(uint8_t bool);
void STM32446Tim4_set_cms(uint8_t value);
void STM32446Tim4_set_dir(uint8_t bool);
void STM32446Tim4_set_opm(uint8_t bool);
void STM32446Tim4_set_urs(uint8_t bool);
void STM32446Tim4_set_udis(uint8_t bool);
void STM32446Tim4_cen(uint8_t bool);
// CR2
void STM32446Tim4_ti1s(uint8_t bool);
void STM32446Tim4_mms(uint8_t value);
void STM32446Tim4_ccds(uint8_t bool);
// SMCR
void STM32446Tim4_etp(uint8_t bool);
void STM32446Tim4_ece(uint8_t bool);
void STM32446Tim4_etps(uint8_t value);
void STM32446Tim5_etf(uint8_t value);
void STM32446Tim4_msm(uint8_t bool);
void STM32446Tim4_ts(uint8_t value);
void STM32446Tim4_sms(uint8_t value);
// DIER
void STM32446Tim4_tde(uint8_t bool);
void STM32446Tim4_cc4de(uint8_t bool);
void STM32446Tim4_cc3de(uint8_t bool);
void STM32446Tim4_cc2de(uint8_t bool);
void STM32446Tim4_cc1de(uint8_t bool);
void STM32446Tim4_ude(uint8_t bool);
void STM32446Tim4_tie(uint8_t bool);
void STM32446Tim4_cc4ie(uint8_t bool);
void STM32446Tim4_cc3ie(uint8_t bool);
void STM32446Tim4_cc2ie(uint8_t bool);
void STM32446Tim4_cc1ie(uint8_t bool);
void STM32446Tim4_uie(uint8_t bool);
// SR
uint8_t STM32446Tim4_cc4of(void);
void STM32446Tim4_clear_cc4of(void);
uint8_t STM32446Tim4_cc3of(void);
void STM32446Tim4_clear_cc3of(void);
uint8_t STM32446Tim4_cc2of(void);
void STM32446Tim4_clear_cc2of(void);
uint8_t STM32446Tim4_cc1of(void);
void STM32446Tim4_clear_cc1of(void);
uint8_t STM32446Tim4_tif(void);
void STM32446Tim4_clear_tif(void);
uint8_t STM32446Tim4_cc4if(void);
void STM32446Tim4_clear_cc4if(void);
uint8_t STM32446Tim4_cc3if(void);
void STM32446Tim4_clear_cc3if(void);
uint8_t STM32446Tim4_cc2if(void);
void STM32446Tim4_clear_cc2if(void);
uint8_t STM32446Tim4_cc1if(void);
void STM32446Tim4_clear_cc1if(void);
uint8_t STM32446Tim4_uif(void);
void STM32446Tim4_clear_uif(void);
// EGR
void STM32446Tim4_tg(void);
void STM32446Tim4_cc4g(void);
void STM32446Tim4_cc3g(void);
void STM32446Tim4_cc2g(void);
void STM32446Tim4_cc1g(void);
void STM32446Tim4_ug(void);
// CCMR1
void STM32446Tim4_oc2ce(uint8_t value);
void STM32446Tim4_oc2m(uint8_t value);
void STM32446Tim4_ic2f(uint8_t value);
void STM32446Tim4_oc2pe(uint8_t bool);
void STM32446Tim4_oc2fe(uint8_t bool);
void STM32446Tim4_ic2psc(uint8_t value);
void STM32446Tim4_cc2s(uint8_t value);
void STM32446Tim4_oc1ce(uint8_t value);
void STM32446Tim4_oc1m(uint8_t value);
void STM32446Tim4_ic1f(uint8_t value);
void STM32446Tim4_oc1pe(uint8_t bool);
void STM32446Tim4_oc1fe(uint8_t bool);
void STM32446Tim4_ic1psc(uint8_t value);
void STM32446Tim4_cc1s(uint8_t value);
// CCMR2
void STM32446Tim4_oc4ce(uint8_t value);
void STM32446Tim4_oc4m(uint8_t value);
void STM32446Tim4_ic4f(uint8_t value);
void STM32446Tim4_oc4pe(uint8_t bool);
void STM32446Tim4_oc4fe(uint8_t bool);
void STM32446Tim4_ic4psc(uint8_t value);
void STM32446Tim4_cc4s(uint8_t value);
void STM32446Tim4_oc3ce(uint8_t value);
void STM32446Tim4_oc3m(uint8_t value);
void STM32446Tim4_ic3f(uint8_t value);
void STM32446Tim4_oc3pe(uint8_t bool);
void STM32446Tim4_oc3fe(uint8_t bool);
void STM32446Tim4_ic3psc(uint8_t value);
void STM32446Tim4_cc3s(uint8_t value);
// CCER
void STM32446Tim4_cc4np(uint8_t bool);
void STM32446Tim4_cc4p(uint8_t bool);
void STM32446Tim4_cc4e(uint8_t bool);
void STM32446Tim4_cc3np(uint8_t bool);
void STM32446Tim4_cc3p(uint8_t bool);
void STM32446Tim4_cc3e(uint8_t bool);
void STM32446Tim4_cc2np(uint8_t bool);
void STM32446Tim4_cc2p(uint8_t bool);
void STM32446Tim4_cc2e(uint8_t bool);
void STM32446Tim4_cc1np(uint8_t bool);
void STM32446Tim4_cc1p(uint8_t bool);
void STM32446Tim4_cc1e(uint8_t bool);
// CNT
void STM32446Tim4_cnt(uint16_t value);
uint16_t STM32446Tim4_get_cnt(void);
// PSC
void STM32446Tim4_psc(uint16_t value);
// ARR
void STM32446Tim4_arr(uint16_t value);
// CCR1
void STM32446Tim4_ccr1(uint16_t value);
// CCR2
void STM32446Tim4_ccr2(uint16_t value);
// CCR3
void STM32446Tim4_ccr3(uint16_t value);
// CCR4
void STM32446Tim4_ccr4(uint16_t value);
// DCR
void STM32446Tim4_dbl(uint8_t value);
void STM32446Tim4_dba(uint8_t value);
// DMAR
void STM32446Tim4_dmab(uint16_t value);
uint16_t STM32446Tim4_get_dmab(void);
/****************************************/
/*** TIM5 Procedure & Function Header ***/
/****************************************/
void STM32446Tim5Clock(uint8_t bool);
void STM32446Tim5Nvic(uint8_t bool);
/*** TIM5 Bit Mapping Header ***/
// CR1
void STM32446Tim5_ckd(uint8_t value);
uint8_t STM32446Tim5_get_ckd(void);
void STM32446Tim5_set_apre(uint8_t bool);
void STM32446Tim5_set_cms(uint8_t value);
void STM32446Tim5_set_dir(uint8_t bool);
void STM32446Tim5_set_opm(uint8_t bool);
void STM32446Tim5_set_urs(uint8_t bool);
void STM32446Tim5_set_udis(uint8_t bool);
void STM32446Tim5_cen(uint8_t bool);
// CR2
void STM32446Tim5_ti1s(uint8_t bool);
void STM32446Tim5_mms(uint8_t value);
void STM32446Tim5_ccds(uint8_t bool);
// SMCR
void STM32446Tim5_etp(uint8_t bool);
void STM32446Tim5_ece(uint8_t bool);
void STM32446Tim5_etps(uint8_t value);
void STM32446Tim5_etf(uint8_t value);
void STM32446Tim5_msm(uint8_t bool);
void STM32446Tim5_ts(uint8_t value);
void STM32446Tim5_sms(uint8_t value);
// DIER
void STM32446Tim5_tde(uint8_t bool);
void STM32446Tim5_cc4de(uint8_t bool);
void STM32446Tim5_cc3de(uint8_t bool);
void STM32446Tim5_cc2de(uint8_t bool);
void STM32446Tim5_cc1de(uint8_t bool);
void STM32446Tim5_ude(uint8_t bool);
void STM32446Tim5_tie(uint8_t bool);
void STM32446Tim5_cc4ie(uint8_t bool);
void STM32446Tim5_cc3ie(uint8_t bool);
void STM32446Tim5_cc2ie(uint8_t bool);
void STM32446Tim5_cc1ie(uint8_t bool);
void STM32446Tim5_uie(uint8_t bool);
// SR
uint8_t STM32446Tim5_cc4of(void);
void STM32446Tim5_clear_cc4of(void);
uint8_t STM32446Tim5_cc3of(void);
void STM32446Tim5_clear_cc3of(void);
uint8_t STM32446Tim5_cc2of(void);
void STM32446Tim5_clear_cc2of(void);
uint8_t STM32446Tim5_cc1of(void);
void STM32446Tim5_clear_cc1of(void);
uint8_t STM32446Tim5_tif(void);
void STM32446Tim5_clear_tif(void);
uint8_t STM32446Tim5_cc4if(void);
void STM32446Tim5_clear_cc4if(void);
uint8_t STM32446Tim5_cc3if(void);
void STM32446Tim5_clear_cc3if(void);
uint8_t STM32446Tim5_cc2if(void);
void STM32446Tim5_clear_cc2if(void);
uint8_t STM32446Tim5_cc1if(void);
void STM32446Tim5_clear_cc1if(void);
uint8_t STM32446Tim5_uif(void);
void STM32446Tim5_clear_uif(void);
// EGR
void STM32446Tim5_tg(void);
void STM32446Tim5_cc4g(void);
void STM32446Tim5_cc3g(void);
void STM32446Tim5_cc2g(void);
void STM32446Tim5_cc1g(void);
void STM32446Tim5_ug(void);
// CCMR1
void STM32446Tim5_oc2ce(uint8_t value);
void STM32446Tim5_oc2m(uint8_t value);
void STM32446Tim5_ic2f(uint8_t value);
void STM32446Tim5_oc2pe(uint8_t bool);
void STM32446Tim5_oc2fe(uint8_t bool);
void STM32446Tim5_ic2psc(uint8_t value);
void STM32446Tim5_cc2s(uint8_t value);
void STM32446Tim5_oc1ce(uint8_t value);
void STM32446Tim5_oc1m(uint8_t value);
void STM32446Tim5_ic1f(uint8_t value);
void STM32446Tim5_oc1pe(uint8_t bool);
void STM32446Tim5_oc1fe(uint8_t bool);
void STM32446Tim5_ic1psc(uint8_t value);
void STM32446Tim5_cc1s(uint8_t value);
// CCMR2
void STM32446Tim5_oc4ce(uint8_t value);
void STM32446Tim5_oc4m(uint8_t value);
void STM32446Tim5_ic4f(uint8_t value);
void STM32446Tim5_oc4pe(uint8_t bool);
void STM32446Tim5_oc4fe(uint8_t bool);
void STM32446Tim5_ic4psc(uint8_t value);
void STM32446Tim5_cc4s(uint8_t value);
void STM32446Tim5_oc3ce(uint8_t value);
void STM32446Tim5_oc3m(uint8_t value);
void STM32446Tim5_ic3f(uint8_t value);
void STM32446Tim5_oc3pe(uint8_t bool);
void STM32446Tim5_oc3fe(uint8_t bool);
void STM32446Tim5_ic3psc(uint8_t value);
void STM32446Tim5_cc3s(uint8_t value);
// CCER
void STM32446Tim5_cc4np(uint8_t bool);
void STM32446Tim5_cc4p(uint8_t bool);
void STM32446Tim5_cc4e(uint8_t bool);
void STM32446Tim5_cc3np(uint8_t bool);
void STM32446Tim5_cc3p(uint8_t bool);
void STM32446Tim5_cc3e(uint8_t bool);
void STM32446Tim5_cc2np(uint8_t bool);
void STM32446Tim5_cc2p(uint8_t bool);
void STM32446Tim5_cc2e(uint8_t bool);
void STM32446Tim5_cc1np(uint8_t bool);
void STM32446Tim5_cc1p(uint8_t bool);
void STM32446Tim5_cc1e(uint8_t bool);
// CNT
void STM32446Tim5_cnt(uint32_t value);
uint32_t STM32446Tim5_get_cnt(void);
// PSC
void STM32446Tim5_psc(uint16_t value);
// ARR
void STM32446Tim5_arr(uint32_t value);
// CCR1
void STM32446Tim5_ccr1(uint32_t value);
// CCR2
void STM32446Tim5_ccr2(uint32_t value);
// CCR3
void STM32446Tim5_ccr3(uint32_t value);
// CCR4
void STM32446Tim5_ccr4(uint32_t value);
// DCR
void STM32446Tim5_dbl(uint8_t value);
void STM32446Tim5_dba(uint8_t value);
// DMAR
void STM32446Tim5_dmab(uint16_t value);
uint16_t STM32446Tim5_get_dmab(void);
// OR
void STM32446Tim5_ti4_rmp(uint8_t value);

/*** INTERRUPT HEADER ***/
void TIM2_IRQHandler(void);
void TIM3_IRQHandler(void);
void TIM4_IRQHandler(void);
void TIM5_IRQHandler(void);

#endif

/*** EOF ***/

/******
1º Sequence
2º Scope
	- Library Scope
	- File Scope
	- Function Scope
	- Precedence Scope
3º Pointer and Variable
4º Casting
******/


